# GetBounds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RepeatingReferenceSource..::..GetBounds Method
RepeatingReferenceSource Class See Also
---
Returns information about the boundaries of the repeating reference array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public RepeaterBounds GetBounds()
```

Visual Basic
---
```text
Public Function GetBounds As RepeaterBounds
```

Visual C++
---
```text
public:
RepeaterBounds^ GetBounds()
```

# ### Return Value
The bounds of the repeating reference source.
# Remarks
See the RepeaterBounds structure for more information about repeating reference source bounds.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The repeating reference source is no longer valid. |

# See Also
RepeatingReferenceSource Class
Autodesk.Revit.DB Namespace